### 📖 Terraform Plan (infra/resources/psn/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_secret.application_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "application_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/iw-p-itn-apps-kv-01"
      + name                    = "ApplicationInsightsConnectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.support_fn_default_key will be created
  + resource "azurerm_key_vault_secret" "support_fn_default_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/iw-p-itn-apps-kv-01"
      + name                    = "support-fn-default-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.user_ioapp_fn_key will be created
  + resource "azurerm_key_vault_secret" "user_ioapp_fn_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/iw-p-itn-apps-kv-01"
      + name                    = "user-ioapp-fn-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.user_ioweb_fn_key will be created
  + resource "azurerm_key_vault_secret" "user_ioweb_fn_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/iw-p-itn-apps-kv-01"
      + name                    = "user-ioweb-fn-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.user_uat_fn_default_key will be created
  + resource "azurerm_key_vault_secret" "user_uat_fn_default_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/iw-p-itn-apps-kv-01"
      + name                    = "user-fn-uat-default-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value_wo                = (write-only attribute)
      + value_wo_version        = 1
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.apim_roles.module.key_vault.azurerm_role_assignment.secrets["iw-p-itn-wallet-rg-01|iw-p-itn-apps-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Allow iw-p-itn-apps-apim-01 to read secrets on iw-p-itn-apps-kv-01"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d0e038ee-f81f-4f7e-8e0f-cbdaf4664d77"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/725dede2-879b-45c5-82fa-eb816875b10c/resourceGroups/iw-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/iw-p-itn-apps-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cdn.azurerm_cdn_frontdoor_custom_domain.this["wallet.io.pagopa.it"],
  on .terraform/modules/cdn/custom_domain.tf line 14, in resource "azurerm_cdn_frontdoor_custom_domain" "this":
  14: resource "azurerm_cdn_frontdoor_custom_domain" "this" {

As of March 1, 2025, support for 'TLS10' will be retired from Azure Front
Door, therefore the 'TLS10' property value will be removed in v5.0 of the
provider.

(and 6 more similar warnings elsewhere)
```

</details>
